[
{
  "title": "temporarily turn off firewalls",
  "category": "network",
  "text": "Sometimes firewall software might prevent you from getting connected. You can see if the connection issue is caused by a firewall by turning it off temporarily and then trying to visit a website you trust.\n\nThe steps to turn off a firewall depend on the firewall software you’re using. Check the documentation for your firewall software to learn how to turn it off. Make sure you turn it back on as soon as you can. Not having a firewall turned on makes your PC more vulnerable to hackers, worms, or viruses.\n\nIf you have trouble turning off your firewall, do the following to turn off all firewall software that's running on your PC. Again, make sure you turn your firewall back on as soon as you can.\n\n## To turn off all firewalls\n\n - In the search box on the taskbar, type **Command prompt**, press and hold (or right-click) **Command prompt**, and then select **Run as administrator** &gt; **Yes**.\n - At the command prompt, type **netsh advfirewall set allprofiles state off**, and then press **Enter**.\n - Open your web browser and visit a website you trust and see if you can connect to it.\n - To turn on all firewalls you might have installed, at the command prompt, type **netsh advfirewall set allprofiles state on**, and then press **Enter**.\n\nIf you find the firewall software is causing the connection issues, contact the software manufacturer or visit their website to check and see if updated software is available."
},
{
  "title": "temporarily turn off any antivirus or malware-prevention software",
  "category": "network",
  "text": "Sometimes antivirus or malware-prevention software might prevent you from getting connected. You can see if the connection issue is caused by antivirus and malware-prevention software by turning it off temporarily and then trying to visit a website you trust. If you find it is causing the connection issues, contact the software manufacturer or visit their website to see if updated software is available.\n\nThe steps to turn off antivirus or malware-prevention software depend on the software you’re using. Check the documentation for your software to learn how to turn it off. Make sure you turn it back on as soon as possible. Not having antivirus or malware-prevention software turned on makes your PC more vulnerable to hackers, worms, or viruses.\n\nIf you’re not sure what antivirus or malware-prevention software program you have installed, Windows might be able to tell you.\n\n## To find out what antivirus or malware-prevention software is installed\n\n - In the search box on the taskbar, type **System and security**, and then select **Review your computer’s status and resolve issues**.\n\nSelect the down arrow next to **Security**. If Windows can detect your antivirus software, it's listed under **Virus protection**. For malware-prevention software, look under **Spyware and unwanted software protection**.\n\n - If the antivirus or malware-prevention software is on, check the documentation for that software to learn how to turn it off.\n\nMake sure you turn your antivirus or malware-prevention software back on as soon as you can to make sure your PC is better protected."
},
{
  "title": "uninstall the network adapter driver and restart",
  "category": "network",
  "text": "If the previous steps didn’t work, try to uninstall the network adapter driver, and then restart your computer and have Windows automatically install the latest driver. Consider this approach if your network connection stopped working properly after a recent update.\n\nBefore uninstalling, make sure you have drivers available as a backup. Visit the PC manufacturer’s website and download the latest network adapter driver from there. If your PC can't connect to the Internet, you'll need to download a driver on a different PC and save it to a USB flash drive so you can install the driver on your PC. You’ll need to know the PC manufacturer and model name or number.\n\n - In the search box on the taskbar, type **Device Manager**, and then select **Device Manager** from the list of results.\n - In Device Manager, select **Network adapters** &gt; the network adapter name.\n - Press and hold (or right-click)&nbsp;the network adapter, and then select **Uninstall device**&nbsp;&gt; **Delete the driver software for this device** check box &gt; **Uninstall**.\n - After uninstalling the driver, select the **Start ** button &gt; **Power**&nbsp;&gt; **Restart**. After your PC restarts, Windows will automatically look for and install the network adapter driver. Check to see if that fixes your connection problem. If Windows doesn't automatically install a driver, try to install the backup driver you saved before uninstalling."
}
]